tutorials/CFD/mydeimUpdated/system/ITHACAPODdict
/*---------------------------------------------------------------------------*\
     ██╗████████╗██╗  ██╗ █████╗  ██████╗ █████╗       ███████╗██╗   ██╗
     ██║╚══██╔══╝██║  ██║██╔══██╗██╔════╝██╔══██╗      ██╔════╝██║   ██║
     ██║   ██║   ███████║███████║██║     ███████║█████╗█████╗  ██║   ██║
     ██║   ██║   ██╔══██║██╔══██║██║     ██╔══██║╚════╝██╔══╝  ╚██╗ ██╔╝
     ██║   ██║   ██║  ██║██║  ██║╚██████╗██║  ██║      ██║      ╚████╔╝ 
     ╚═╝   ╚═╝   ╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝╚═╝  ╚═╝      ╚═╝       ╚═══╝  
 
 * In real Time Highly Advanced Computational Applications for Finite Volumes 
 * Copyright (C) 2017 by the ITHACA-FV authors
-------------------------------------------------------------------------------

  License
  This file is part of ITHACA-FV

  ITHACA-FV is free software: you can redistribute it and/or modify
  it under the terms of the GNU Lesser General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  ITHACA-FV is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
  GNU Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public License
  along with ITHACA-FV. If not, see <http://www.gnu.org/licenses/>.

\*---------------------------------------------------------------------------*/
FoamFile
{
    version     5.0;
    format      ascii;
    class       dictionary;
    object      ITHACAPODdict;
}

// Set fields you want to use to perform the POD
// Do not specify here the field name but insert it in the subdictionary 
fields
(
U_pod
p_pod
);

U_pod
{
// Specify the field name
field_name U;
// Specify the number of modes you want to extract
nmodes 2;
// Specify the type of field (if vector or scalar)
field_type vector;
}

p_pod
{
// Specify the field name
field_name p;
// Specify the number of modes you want to extract
nmodes 2;
// Specify the type of field (if vector or scalar)
field_type scalar;
}

// Set Time from which you want to start taking the Snapshots
InitialTime 0;

// Set Time when you want to stop taking the Snapshots
FinalTime 5;

// Eventually you could set just InitalTime and Number of Snapshots you want    
//Nsnapshots 4;
